## Terraform Plan

| Step | Result |
|------|--------|
| Format Check | :x: `failure` |
| Init         | :white_check_mark: `success` |
| Validate     | :white_check_mark: `success` |
| Plan         | :white_check_mark: `success` |

<details><summary>Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_access_entry.local_admin will be created
  + resource "aws_eks_access_entry" "local_admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-platform-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::271758791081:user/devops-practise-q"
      + region            = "us-east-2"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.local_admin will be created
  + resource "aws_eks_access_policy_association" "local_admin" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-platform-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::271758791081:user/devops-practise-q"
      + region        = "us-east-2"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_iam_role_policy.external-admin-eks-access will be created
  + resource "aws_iam_role_policy" "external-admin-eks-access" {
      + id          = (known after apply)
      + name        = "eks-admin-read-only-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                          + "eks:ListClusters",
                          + "eks:AccessKubernetesApi",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "external-admin"
    }

  # aws_iam_role_policy.external-developer-eks-access will be created
  + resource "aws_iam_role_policy" "external-developer-eks-access" {
      + id          = (known after apply)
      + name        = "eks-developer-readonly-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                          + "eks:AccessKubernetesApi",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "external-developer"
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "8.3.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.aws-load-balancer-controller will be created
  + resource "helm_release" "aws-load-balancer-controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "clusterName"
              + value = "eks-platform-eks-cluster"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "vpcId"
              + value = "vpc-0553dfe3a8404ad89"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.name"
              + value = "aws-load-balancer-controller"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
              + value = (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.13.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.cluster-autoscaler will be created
  + resource "helm_release" "cluster-autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "autoDiscovery.clusterName"
              + value = "eks-platform-eks-cluster"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "awsRegion"
              + value = "us-east-2"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "rbac.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "rbac.serviceAccount.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "rbac.serviceAccount.name"
              + value = "cluster-autoscaler"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
              + value = (known after apply)
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "extraArgs.scale-down-unneeded-time"
              + value = "2m"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "extraArgs.skip-nodes-with-local-storage"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "extraArgs.skip-nodes-with-system-pods"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "9.50.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.external-secrets will be created
  + resource "helm_release" "external-secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "serviceAccount.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.name"
              + value = "external-secrets"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
              + value = (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "0.19.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio-base will be created
  + resource "helm_release" "istio-base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.26.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio-ingressgate will be created
  + resource "helm_release" "istio-ingressgate" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-ingressgateway"
      + namespace                  = "istio-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                labels:
                  istio: ingressgateway
                
                service:
                  type: LoadBalancer
                  annotations:
                    service.beta.kubernetes.io/aws-load-balancer-type: "nlb"
                    service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
                    service.beta.kubernetes.io/aws-load-balancer-attributes: "load_balancing.cross_zone.enabled=true"
                    service.beta.kubernetes.io/aws-load-balancer-nlb-target-type: ip
                    service.beta.kubernetes.io/aws-load-balancer-healthcheck-port: "15021"
                    service.beta.kubernetes.io/aws-load-balancer-healthcheck-protocol: "TCP"
                  ports:
                    - name: status-port
                      port: 15021
                      targetPort: 15021
                    - name: http2
                      port: 80
                      targetPort: 8080
                      protocol: TCP
                    - name: https
                      port: 443
                      targetPort: 8443
                      protocol: TCP
                
                containerPorts:
                  status-port: 15021
                  http2: 8080
                  https: 8443
            EOT,
        ]
      + verify                     = false
      + version                    = "1.26.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio_prometheus will be created
  + resource "helm_release" "istio_prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "76.4.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istiod will be created
  + resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istiod"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.26.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kyverno will be created
  + resource "helm_release" "kyverno" {
      + atomic                     = false
      + chart                      = "kyverno"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kyverno"
      + namespace                  = "kyverno"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kyverno.github.io/kyverno/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                admissionController:
                  replicas: 1
                backgroundController:
                  enabled: true
                reportsController:
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "3.2.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.metrics-server will be created
  + resource "helm_release" "metrics-server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "3.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.netpol_allow_dns will be created
  + resource "kubectl_manifest" "netpol_allow_dns" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NetworkPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "allow-dns-egress"
      + namespace               = "online-boutique"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: NetworkPolicy
            metadata:
              name: allow-dns-egress
              namespace: online-boutique
            spec:
              egress:
              - ports:
                - port: 53
                  protocol: UDP
                - port: 53
                  protocol: TCP
                to:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: kube-system
              podSelector: {}
              policyTypes:
              - Egress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.netpol_allow_intra_namespace will be created
  + resource "kubectl_manifest" "netpol_allow_intra_namespace" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NetworkPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "allow-intra-namespace"
      + namespace               = "online-boutique"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: NetworkPolicy
            metadata:
              name: allow-intra-namespace
              namespace: online-boutique
            spec:
              egress:
              - to:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: online-boutique
              ingress:
              - from:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: online-boutique
              podSelector: {}
              policyTypes:
              - Ingress
              - Egress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.netpol_allow_istio will be created
  + resource "kubectl_manifest" "netpol_allow_istio" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NetworkPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "allow-istio-control-plane"
      + namespace               = "online-boutique"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: NetworkPolicy
            metadata:
              name: allow-istio-control-plane
              namespace: online-boutique
            spec:
              egress:
              - to:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: istio-system
              ingress:
              - from:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: istio-system
              podSelector: {}
              policyTypes:
              - Ingress
              - Egress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.netpol_allow_prometheus will be created
  + resource "kubectl_manifest" "netpol_allow_prometheus" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NetworkPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "allow-prometheus-scrape"
      + namespace               = "online-boutique"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: NetworkPolicy
            metadata:
              name: allow-prometheus-scrape
              namespace: online-boutique
            spec:
              ingress:
              - from:
                - namespaceSelector:
                    matchLabels:
                      kubernetes.io/metadata.name: monitoring
                ports:
                - port: 9090
                  protocol: TCP
                - port: 15090
                  protocol: TCP
              podSelector: {}
              policyTypes:
              - Ingress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.netpol_default_deny will be created
  + resource "kubectl_manifest" "netpol_default_deny" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NetworkPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default-deny-all"
      + namespace               = "online-boutique"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: NetworkPolicy
            metadata:
              name: default-deny-all
              namespace: online-boutique
            spec:
              podSelector: {}
              policyTypes:
              - Ingress
              - Egress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.pdb_argocd_repo_server will be created
  + resource "kubectl_manifest" "pdb_argocd_repo_server" {
      + api_version             = "policy/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodDisruptionBudget"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "argocd-repo-server-pdb"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1
            kind: PodDisruptionBudget
            metadata:
              name: argocd-repo-server-pdb
              namespace: argocd
            spec:
              minAvailable: 1
              selector:
                matchLabels:
                  app.kubernetes.io/name: argocd-repo-server
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.pdb_argocd_server will be created
  + resource "kubectl_manifest" "pdb_argocd_server" {
      + api_version             = "policy/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodDisruptionBudget"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "argocd-server-pdb"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1
            kind: PodDisruptionBudget
            metadata:
              name: argocd-server-pdb
              namespace: argocd
            spec:
              minAvailable: 1
              selector:
                matchLabels:
                  app.kubernetes.io/name: argocd-server
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.pdb_grafana will be created
  + resource "kubectl_manifest" "pdb_grafana" {
      + api_version             = "policy/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodDisruptionBudget"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "grafana-pdb"
      + namespace               = "monitoring"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1
            kind: PodDisruptionBudget
            metadata:
              name: grafana-pdb
              namespace: monitoring
            spec:
              minAvailable: 1
              selector:
                matchLabels:
                  app.kubernetes.io/name: grafana
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.pdb_kyverno_admission will be created
  + resource "kubectl_manifest" "pdb_kyverno_admission" {
      + api_version             = "policy/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodDisruptionBudget"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kyverno-admission-pdb"
      + namespace               = "kyverno"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1
            kind: PodDisruptionBudget
            metadata:
              name: kyverno-admission-pdb
              namespace: kyverno
            spec:
              minAvailable: 1
              selector:
                matchLabels:
                  app.kubernetes.io/component: admission-controller
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.pdb_prometheus will be created
  + resource "kubectl_manifest" "pdb_prometheus" {
      + api_version             = "policy/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PodDisruptionBudget"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prometheus-pdb"
      + namespace               = "monitoring"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: policy/v1
            kind: PodDisruptionBudget
            metadata:
              name: prometheus-pdb
              namespace: monitoring
            spec:
              minAvailable: 1
              selector:
                matchLabels:
                  app.kubernetes.io/name: prometheus
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.policy_disallow_host_namespaces will be created
  + resource "kubectl_manifest" "policy_disallow_host_namespaces" {
      + api_version             = "kyverno.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "disallow-host-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              annotations:
                policies.kyverno.io/description: Host namespaces (PID, IPC, network) allow containers
                  to access shared host-level resources. This policy disallows the use of host
                  namespaces.
                policies.kyverno.io/severity: high
                policies.kyverno.io/title: Disallow Host Namespaces
              name: disallow-host-namespaces
            spec:
              background: true
              rules:
              - exclude:
                  any:
                  - resources:
                      kinds:
                      - Pod
                      namespaces:
                      - monitoring
                      - kube-system
                      - istio-system
                      - istio-ingress
                match:
                  any:
                  - resources:
                      kinds:
                      - Pod
                name: check-host-namespaces
                validate:
                  message: Host namespaces (hostPID, hostIPC, hostNetwork) are not allowed.
                  pattern:
                    spec:
                      =(hostIPC): false
                      =(hostNetwork): false
                      =(hostPID): false
              validationFailureAction: Enforce
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.policy_disallow_latest_tag will be created
  + resource "kubectl_manifest" "policy_disallow_latest_tag" {
      + api_version             = "kyverno.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "disallow-latest-tag"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              annotations:
                policies.kyverno.io/description: The latest tag is mutable and can cause unexpected
                  behaviour. This policy disallows images using the latest tag.
                policies.kyverno.io/severity: medium
                policies.kyverno.io/title: Disallow Latest Tag
              name: disallow-latest-tag
            spec:
              background: true
              rules:
              - match:
                  any:
                  - resources:
                      kinds:
                      - Pod
                      namespaces:
                      - online-boutique
                name: check-image-tag
                validate:
                  message: Using the latest tag is not allowed. Specify a concrete image tag.
                  pattern:
                    spec:
                      containers:
                      - image: '!*:latest'
              validationFailureAction: Enforce
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.policy_disallow_privileged will be created
  + resource "kubectl_manifest" "policy_disallow_privileged" {
      + api_version             = "kyverno.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "disallow-privileged-containers"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              annotations:
                policies.kyverno.io/description: Privileged containers have access to all Linux
                  kernel capabilities and can escape container isolation. This policy disallows
                  privileged containers.
                policies.kyverno.io/severity: high
                policies.kyverno.io/title: Disallow Privileged Containers
              name: disallow-privileged-containers
            spec:
              background: true
              rules:
              - match:
                  any:
                  - resources:
                      kinds:
                      - Pod
                name: check-privileged
                validate:
                  message: Privileged containers are not allowed.
                  pattern:
                    spec:
                      containers:
                      - =(securityContext):
                          =(privileged): false
              validationFailureAction: Enforce
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.policy_require_non_root will be created
  + resource "kubectl_manifest" "policy_require_non_root" {
      + api_version             = "kyverno.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "require-non-root-user"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              annotations:
                policies.kyverno.io/description: Containers must not run as root. This policy
                  requires runAsNonRoot to be set to true.
                policies.kyverno.io/severity: medium
                policies.kyverno.io/title: Require Non-Root User
              name: require-non-root-user
            spec:
              background: true
              rules:
              - match:
                  any:
                  - resources:
                      kinds:
                      - Pod
                      namespaces:
                      - online-boutique
                name: check-non-root
                validate:
                  message: Containers must not run as root. Set securityContext.runAsNonRoot=true.
                  pattern:
                    spec:
                      containers:
                      - securityContext:
                          runAsNonRoot: true
              validationFailureAction: Audit
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.policy_require_resource_limits will be created
  + resource "kubectl_manifest" "policy_require_resource_limits" {
      + api_version             = "kyverno.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterPolicy"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "require-resource-limits"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              annotations:
                policies.kyverno.io/description: Resource limits prevent containers from consuming
                  excessive CPU and memory. This policy requires all containers to have resource
                  limits defined.
                policies.kyverno.io/severity: medium
                policies.kyverno.io/title: Require Resource Limits
              name: require-resource-limits
            spec:
              background: true
              rules:
              - match:
                  any:
                  - resources:
                      kinds:
                      - Pod
                      namespaces:
                      - online-boutique
                name: check-resource-limits
                validate:
                  message: Resource limits for CPU and memory are required.
                  pattern:
                    spec:
                      containers:
                      - resources:
                          limits:
                            cpu: ?*
                            memory: ?*
              validationFailureAction: Audit
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_namespace_v1.online-boutique will be created
  + resource "kubernetes_namespace_v1" "online-boutique" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
            }
          + name             = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # time_sleep.wait_for_kyverno_crds will be created
  + resource "time_sleep" "wait_for_kyverno_crds" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.aws_load_balancer_controller_irsa.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides permissions for AWS Load Balancer Controller addon"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "AWS_Load_Balancer_Controller-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTrustStores",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                          + "elasticloadbalancing:DescribeCapacityReservation",
                          + "ec2:GetSecurityGroupsForVpc",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeIpamPools",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ec2:CreateSecurityGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:ModifyListenerAttributes",
                          + "elasticloadbalancing:ModifyIpPools",
                          + "elasticloadbalancing:ModifyCapacityReservation",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "elasticloadbalancing:AddTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resou

... output truncated ...
```

</details>

> Triggered by @gdawsonkesson via `pull_request`